[
    {
        "tag": "greeting",
        "patterns": ["Hi", "Hello", "Hey", "How are you"],
        "responses": [
            "Hello! How can I assist you with your medicine queries today?",
            "Hi there! What medicine information do you need?",
            "Hey! How can I help you today?"
        ]
    },
    {
        "tag": "goodbye",
        "patterns": ["Bye", "See you later", "Goodbye", "Take care"],
        "responses": [
            "Goodbye! Take care of your health!",
            "See you later! Stay healthy!",
            "Goodbye! Feel free to reach out if you have more questions!"
        ]
    },
    {
        "tag": "thanks",
        "patterns": ["Thank you", "Thanks", "Thanks a lot", "I appreciate it"],
        "responses": [
            "You're welcome! Stay healthy!",
            "No problem! Glad I could help!",
            "You're welcome! Take care!"
        ]
    },
    {
        "tag": "about",
        "patterns": ["What can you do", "Who are you", "What are you", "What is your purpose"],
        "responses": [
            "I am a medicine information chatbot here to provide details about various medications.",
            "My purpose is to assist you with information about medicines and their uses."
        ]
    },
    {
        "tag": "dolo_650_definition",
        "patterns": ["Tell me about Dolo 650", "What is Dolo 650", "What is the composition of Dolo 650", "Explain Dolo 650"],
        "responses": [
            "Dolo 650 is a tablet containing 650 mg of Paracetamol (Acetaminophen). It is used to relieve pain and reduce fever.",
            "It contains Paracetamol, which is both an analgesic (pain reliever) and antipyretic (fever reducer)."
        ]
    },
    {
        "tag": "dolo_650_usage",
        "patterns": ["What is Dolo 650 used for", "When to use Dolo 650", "Who can use Dolo 650", "How is Dolo 650 used"],
        "responses": [
            "Dolo 650 is used to relieve headaches, toothaches, body aches, back pain, and fever caused by colds or flu.",
            "It is suitable for short-term pain relief and fever management in adults and children above a certain age, as advised by a doctor."
        ]
    },
    {
        "tag": "dolo_650_side_effects",
        "patterns": ["What are the side effects of Dolo 650", "Dolo 650 side effects", "Are there any side effects of Dolo 650"],
        "responses": [
            "Common side effects include nausea, vomiting, stomach upset, and dizziness.",
            "Excessive use can lead to serious liver damage. Seek medical attention for symptoms like dark urine, yellowing of the skin, or severe abdominal pain."
        ]
    },
    {
        "tag": "paracetamol_definition",
        "patterns": ["Tell me about Paracetamol", "What is Paracetamol", "What is the composition of Paracetamol", "Explain Paracetamol"],
        "responses": [
            "Paracetamol, also known as Acetaminophen, is a widely used over-the-counter pain reliever and fever reducer.",
            "It works by inhibiting chemicals in the brain responsible for pain and fever."
        ]
    },
    {
        "tag": "paracetamol_usage",
        "patterns": ["What is Paracetamol used for", "When to use Paracetamol", "Who can use Paracetamol", "How is Paracetamol used"],
        "responses": [
            "Paracetamol is used for treating mild to moderate pain, such as headaches, toothaches, and fever.",
            "It is commonly used by both adults and children for fever and pain relief. Always follow dosage instructions."
        ]
    },
    {
        "tag": "paracetamol_side_effects",
        "patterns": ["What are the side effects of Paracetamol", "Paracetamol side effects", "Are there any side effects of Paracetamol"],
        "responses": [
            "Side effects are rare but may include nausea and allergic reactions like rashes.",
            "Overdose can lead to liver damage. Seek immediate help if you notice yellowing of the skin or eyes, or severe abdominal pain."
        ]
    },
    {
        "tag": "paracetamol_dosage",
        "patterns": ["What is the dosage of Paracetamol", "How much Paracetamol should I take", "Paracetamol dosage", "How to take Paracetamol"],
        "responses": [
            "The typical adult dose is 500 mg to 1000 mg every 4 to 6 hours, not exceeding 4000 mg per day.",
            "Children's dosage depends on age and weight. Consult a doctor for pediatric use."
        ]
    },
    {
        "tag": "ibuprofen_definition",
        "patterns": ["Tell me about Ibuprofen", "What is Ibuprofen", "What is the composition of Ibuprofen", "Explain Ibuprofen"],
        "responses": [
            "Ibuprofen is a nonsteroidal anti-inflammatory drug (NSAID) used to relieve pain, reduce fever, and decrease inflammation.",
            "It works by blocking enzymes responsible for inflammation and pain."
        ]
    },
    {
        "tag": "ibuprofen_usage",
        "patterns": ["What is Ibuprofen used for", "When to use Ibuprofen", "Who can use Ibuprofen", "How is Ibuprofen used"],
        "responses": [
            "Ibuprofen is used for conditions like arthritis, menstrual cramps, muscle pain, and fever.",
            "It is effective for short-term relief of pain and inflammation."
        ]
    },
    {
        "tag": "ibuprofen_side_effects",
        "patterns": ["What are the side effects of Ibuprofen", "Ibuprofen side effects", "Are there any side effects of Ibuprofen"],
        "responses": [
            "Common side effects include nausea, stomach pain, and dizziness.",
            "Serious side effects can include gastrointestinal bleeding, kidney damage, and allergic reactions. Take it with food and follow dosage instructions carefully."
        ]
    },
    {
        "tag": "ibuprofen_dosage",
        "patterns": ["What is the dosage of Ibuprofen", "How much Ibuprofen should I take", "Ibuprofen dosage", "How to take Ibuprofen"],
        "responses": [
            "The usual adult dose is 200–400 mg every 4–6 hours as needed. Do not exceed 1200 mg/day without medical supervision.",
            "Children’s dosage is based on weight and age. Consult a healthcare provider before use."
        ]
    },
    {
        "tag": "amoxicillin_definition",
        "patterns": ["Tell me about Amoxicillin", "What is Amoxicillin", "What is the composition of Amoxicillin", "Explain Amoxicillin"],
        "responses": [
            "Amoxicillin is a penicillin-type antibiotic used to treat various bacterial infections like pneumonia and bronchitis.",
            "It works by preventing the growth of bacteria by disrupting their cell wall."
        ]
    },
    {
        "tag": "amoxicillin_usage",
        "patterns": ["What is Amoxicillin used for", "When to use Amoxicillin", "Who can use Amoxicillin", "How is Amoxicillin used"],
        "responses": [
            "Amoxicillin is used to treat infections of the ear, throat, lungs, urinary tract, and skin.",
            "It must be taken as prescribed, and the full course should be completed even if symptoms improve."
        ]
    },
    {
        "tag": "amoxicillin_side_effects",
        "patterns": ["What are the side effects of Amoxicillin", "Amoxicillin side effects", "Are there any side effects of Amoxicillin"],
        "responses": [
            "Common side effects include nausea, vomiting, diarrhea, and skin rash.",
            "Serious reactions include allergic responses like swelling or breathing difficulty. Seek medical attention if these occur."
        ]
    },
    {
        "tag": "amoxicillin_dosage",
        "patterns": ["What is the dosage of Amoxicillin", "How much Amoxicillin should I take", "Amoxicillin dosage", "How to take Amoxicillin"],
        "responses": [
            "Typical adult dose is 250–500 mg every 8 hours, or 500–875 mg every 12 hours, depending on the infection.",
            "Children’s dosage depends on age and weight. Follow your doctor's instructions strictly."
        ]
    },
    {
        "tag": "azithromycin_definition",
        "patterns": ["Tell me about Azithromycin", "What is Azithromycin", "What is the composition of Azithromycin", "Explain Azithromycin"],
        "responses": [
            "Azithromycin is a macrolide antibiotic used to treat a variety of bacterial infections including respiratory, skin, and ear infections.",
            "It works by stopping bacterial growth through inhibition of protein synthesis."
        ]
    },
    {
        "tag": "azithromycin_usage",
        "patterns": ["What is Azithromycin used for", "When to use Azithromycin", "Who can use Azithromycin", "How is Azithromycin used"],
        "responses": [
            "Azithromycin is used for infections like pneumonia, bronchitis, sinusitis, and some sexually transmitted infections.",
            "It is effective for bacterial infections and should be used only as prescribed by a doctor."
        ]
    },
    {
        "tag": "azithromycin_side_effects",
        "patterns": ["What are the side effects of Azithromycin", "Azithromycin side effects", "Are there any side effects of Azithromycin"],
        "responses": [
            "Common side effects include nausea, diarrhea, abdominal pain, and headache.",
            "Serious side effects include allergic reactions and severe diarrhea caused by C. difficile. Seek medical help if severe symptoms occur."
        ]
    },
    {
        "tag": "azithromycin_dosage",
        "patterns": ["What is the dosage of Azithromycin", "How much Azithromycin should I take", "Azithromycin dosage", "How to take Azithromycin"],
        "responses": [
            "Typical adult dosage is 500 mg on the first day, followed by 250 mg once daily for the next 4 days.",
            "Dosage may vary depending on the condition. Always follow your doctor’s instructions."
        ]
    },
    {
        "tag": "alerid_definition",
        "patterns": ["Tell me about Alerid", "What is Alerid", "What is the composition of Alerid", "Explain Alerid"],
        "responses": [
            "Alerid is a brand name for Cetirizine, an antihistamine used to treat allergy symptoms.",
            "It works by blocking histamine, a substance that causes allergic reactions in the body."
        ]
    },
    {
        "tag": "alerid_usage",
        "patterns": ["What is Alerid used for", "When to use Alerid", "Who can use Alerid", "How is Alerid used"],
        "responses": [
            "Alerid is used to relieve symptoms of hay fever, allergies, and hives.",
            "It can be used by adults and children over the age of 6, as directed by a doctor."
        ]
    },
    {
        "tag": "alerid_side_effects",
        "patterns": ["What are the side effects of Alerid", "Alerid side effects", "Are there any side effects of Alerid"],
        "responses": [
            "Common side effects include drowsiness, headache, dry mouth, and dizziness.",
            "Serious allergic reactions are rare but may include swelling, rash, and difficulty breathing."
        ]
    }
]
